Vocabulary for Lady Macbeth:

Nouns:
ache  
action  
age  
air  
ambition  
anger  
arm  
ash  
aspiration  
bane  
battle  
bed  
bell  
birth  
blade  
blessing  
blood  
bond  
bone  
book  
bough  
bounty  
bowl  
boy  
breath  
bride  
brother  
burden  
burn  
calamity  
calm  
candle  
cause  
chain  
chamber  
change  
charity  
charm  
cheek  
choice  
circle  
cloak  
cloud  
cold  
comfort  
command  
confession  
conflict  
courage  
court  
coward  
cradle  
craft  
crown  
curse  
dance  
danger  
dark  
daughter  
day  
death  
deed  
delight  
desire  
destiny  
dew  
discord  
dream  
drink  
dust  
duty  
edge  
end  
envy  
error  
eternity  
evening  
evil  
eye  
face  
fall  
fame  
fear  
feast  
feather  
fever  
fight  
fire  
flesh  
flower  
fog  
foe  
fold  
fool  
foot  
forest  
forgiveness  
fortune  
foul  
freedom  
friend  
frost  
fruit  
fury  
future  
gain  
garden  
garment  
gate  
ghost  
gift  
glance  
glory  
governor  
grace  
grave  
grief  
guilt  
gulf  
guest  
habit  
hand  
harvest  
hate  
head  
heart  
heaven  
hell  
herald  
herb  
hope  
horn  
hour  
hunger  
hurt  
husband  
ice  
image  
innocence  
instrument  
iron  
joy  
judge  
judgment  
kingship  
kiss  
knife  
labour  
lady  
lamp  
land  
language  
law  
leaf  
lie  
life  
light  
line  
lion  
love  
lust  
man  
mask  
meadow  
memory  
mercy  
mind  
mirror  
mist  
moment  
moon  
morrow  
mother  
mouth  
music  
name  
nation  
nature  
need  
net  
night  
noise  
north  
notion  
oak  
oath  
offering  
order  
pain  
palace  
parent  
passion  
path  
patience  
peace  
pen  
peril  
pity  
plan  
plea  
pleasure  
poison  
power  
prayer  
presence  
pride  
prince  
prison  
promise  
prophecy  
queen  
question  
rain  
rage  
rank  
reason  
rebuke  
remedy  
revenge  
ring  
ritual  
robe  
rock  
rose  
rule  
sacrifice  
sadness  
salt  
scar  
scene  
scorn  
sea  
season  
secret  
seed  
serpent  
shade  
shadow  
shame  
shape  
shepherd  
shield  
shock  
shroud  
sight  
silence  
silver  
sin  
sister  
sky  
sleep  
smile  
smoke  
snow  
soil  
sorrow  
soul  
sound  
speech  
spell  
spirit  
spring  
staff  
stag  
stain  
star  
state  
step  
stone  
storm  
story  
strength  
strife  
struggle  
sun  
supper  
sword  
sympathy  
table  
task  
tear  
temptation  
terror  
thirst  
thought  
threshold  
throne  
thunder  
tide  
time  
tongue  
tooth  
torch  
touch  
tower  
traitor  
trap  
tree  
trial  
trick  
truth  
tune  
twin  
vapor  
veil  
vengeance  
vice  
vigil  
vine  
virtue  
voice  
void  
vow  
war  
warmth  
waste  
watch  
water  
wave  
way  
weather  
weeping  
whisper  
will  
wind  
wine  
wing  
wisdom  
wish  
witch  
woman  
wonder  
word  
work  
wound  
wrath  
wreath  
wreck  
year  
youth  

Verbs:

abandon  
abide  
accept  
accuse  
achieve  
acknowledge  
act  
admit  
allow  
answer  
appear  
approach  
ascend  
ask  
assume  
attain  
attempt  
avert  
avoid  
bear  
begin  
bind  
blame  
bless  
break  
bring  
build  
burn  
bury  
call  
calm  
cast  
cause  
cease  
change  
choose  
claim  
climb  
close  
command  
confess  
conquer  
consider  
contend  
control  
cross  
curse  
cut  
dare  
darken  
deceive  
declare  
defend  
deny  
depart  
desire  
destroy  
determine  
die  
disguise  
disobey  
display  
disturb  
divide  
do  
doubt  
draw  
drink  
drive  
eat  
embrace  
end  
endure  
enter  
escape  
execute  
expect  
fall  
feed  
feel  
fight  
find  
finish  
flee  
follow  
forbid  
force  
forget  
forgive  
forsake  
frame  
gather  
give  
go  
grasp  
guard  
guide  
hail  
hang  
harden  
hate  
have  
hear  
heed  
hide  
hold  
hope  
honor  
hurt  
ignore  
imagine  
impede  
implore  
incite  
increase  
inflict  
inspire  
interpret  
intervene  
invoke  
judge  
keep  
kill  
know  
lament  
lead  
leave  
let  
lie  
listen  
live  
lose  
love  
make  
mark  
marry  
meet  
mock  
mourn  
move  
murder  
obey  
offer  
open  
overcome  
overthrow  
own  
pass  
pay  
perceive  
perform  
persuade  
plan  
please  
plot  
possess  
pray  
prepare  
press  
proclaim  
protect  
prove  
pull  
punish  
pursue  
put  
question  
raise  
reach  
read  
receive  
refuse  
regret  
reject  
remember  
remove  
repent  
replace  
reveal  
ride  
rise  
rob  
rule  
run  
sacrifice  
save  
say  
see  
seek  
seize  
send  
serve  
shed  
shout  
show  
shrink  
shut  
signify  
sin  
slay  
sleep  
speak  
spill  
spread  
stand  
start  
stay  
steal  
step  
stop  
strike  
strive  
study  
subdue  
succeed  
suffer  
supply  
support  
surpass  
survive  
suspect  
swear  
sway  
take  
talk  
teach  
tear  
tell  
tempt  
thank  
think  
threaten  
throw  
toil  
touch  
train  
transform  
tremble  
try  
turn  
understand  
undo  
unite  
uphold  
use  
utter  
vanish  
view  
wait  
walk  
want  
warn  
wash  
waste  
watch  
wear  
weep  
win  
wish  
withdraw  
withstand  
wonder  
work  
wound  
write

Adjectives:

alive  
ancient  
animal  
assailable  
baby  
boneless  
brainsickly  
bodily  
bloody  
compunctious  
constancy  
continually  
convenient  
corporal  
country  
cruelty  
doubtful  
dreadful  
drowsy  
easy  
ecstasy  
emotional  
english  
envy  
every  
fatal  
filthy  
fitful  
folly  
foolish  
freely  
furious  
fury  
general  
gory  
hearty  
hideous  
hierarchical  
highly  
holily  
honesty  
horrible  
ignorant  
impossible  
infirmity  
innocent  
instant  
invisible  
jovial  
joyful  
lacy  
lofty  
loyal  
marrowless  
material  
majesty  
mighty  
momentary  
moral  
mortal  
mortality  
multitudinous  
murky  
natural  
neutral  
nightly  
only  
ornament  
parley  
patient  
personal  
pitiful  
pitiless  
pleasant  
poorly  
precious  
present  
prosperous  
psychological  
ready  
regretful  
remorseful  
resolute  
respectful  
restless  
revengeful  
royal  
rueful  
sable  
sacrificial  
sad  
safe  
saucy  
scornful  
seeming  
severe  
shameful  
shapeless  
sickly  
silent  
silly  
sleepless  
slippery  
solemn  
solid  
spacious  
spiritual  
steely  
stormy  
strange  
strong  
subtle  
supernatural  
sure  
surprising  
suspicious  
swift  
tedious  
temporal  
thankful  
timely  
timid  
tormented  
traitorous  
tranquil  
truthful  
tyrannical  
unaccustomed  
unearthly  
unfaithful  
unholy  
unjust  
unmanned  
unnatural  
unquiet  
unreal  
unspeakable  
unsteady  
untimely  
urgent  
vague  
valiant  
vile  
violent  
virtuous  
vital  
wanton  
weak  
weary  
weird  
wild  
wilful  
willing  
willingly  
wise  
woeful  
wondrous  
wrathful  
wrongful